In [2]:
import pandas as pd
import os
from functools import reduce

In [4]:
cwd = os.getcwd()
print(cwd)

/Users/jocelinbordet/Documents/Pro/DSB/S1/Python_for_DS/Groupwork/explo/air-passengers-dsb

In [3]:
d0 = pd.read_csv('data/multiTimeline.csv', skiprows=2)
d1 = pd.read_csv('data/multiTimeline_1.csv', skiprows=2)
d2 = pd.read_csv('data/multiTimeline_2.csv', skiprows=2)
d3 = pd.read_csv('data/multiTimeline_3.csv', skiprows=2)
d4 = pd.read_csv('data/multiTimeline_4.csv', skiprows=2)

In [7]:
dfs = [d0, d1, d2, d3, d4]

In [8]:
df_final = reduce(lambda left,right: pd.merge(left,right,on='Semaine'), dfs)

In [9]:
df_final.columns

Index(['Semaine', 'new york flight: (Dans tous les pays)_x',
       'atlanta flight: (Dans tous les pays)',
       'boston flight: (Dans tous les pays)',
       'chicago flight: (Dans tous les pays)',
       'charlotte flight: (Dans tous les pays)',
       'new york flight: (Dans tous les pays)_y',
       'dallas flight: (Dans tous les pays)',
       'denver flight: (Dans tous les pays)',
       'detroit flight: (Dans tous les pays)',
       'houston flight: (Dans tous les pays)',
       'new york flight: (Dans tous les pays)_x',
       'las vegas flight: (Dans tous les pays)',
       'los angeles flight: (Dans tous les pays)',
       'miami flight: (Dans tous les pays)',
       'minneapolis flight: (Dans tous les pays)',
       'new york flight: (Dans tous les pays)_y',
       'orlando flight: (Dans tous les pays)',
       'philadelphia flight: (Dans tous les pays)',
       'phoenix flight: (Dans tous les pays)',
       'san francisco flight: (Dans tous les pays)',
       'new york flight: (Dans tous les pays)',
       'seattle flight: (Dans tous les pays)'],
      dtype='object')

In [10]:
df = df_final.drop(df_final.columns[[1, 6, 11, 16]], axis='columns')

In [11]:
df.columns

Index(['Semaine', 'atlanta flight: (Dans tous les pays)',
       'boston flight: (Dans tous les pays)',
       'chicago flight: (Dans tous les pays)',
       'charlotte flight: (Dans tous les pays)',
       'dallas flight: (Dans tous les pays)',
       'denver flight: (Dans tous les pays)',
       'detroit flight: (Dans tous les pays)',
       'houston flight: (Dans tous les pays)',
       'las vegas flight: (Dans tous les pays)',
       'los angeles flight: (Dans tous les pays)',
       'miami flight: (Dans tous les pays)',
       'minneapolis flight: (Dans tous les pays)',
       'orlando flight: (Dans tous les pays)',
       'philadelphia flight: (Dans tous les pays)',
       'phoenix flight: (Dans tous les pays)',
       'san francisco flight: (Dans tous les pays)',
       'new york flight: (Dans tous les pays)',
       'seattle flight: (Dans tous les pays)'],
      dtype='object')

In [12]:
df.columns = ['Date', 'Atlanta', 'Boston', 'Chicago', 'Charlotte', 'Dallas-Fort Worth', 'Denver', 'Detroit', 'Houston', 'Las Vegas', 'Los Angeles', 'Miami', 'Minneapolis', 'Orlando', 'Philadelphia', 'Phoenix', 'San Francisco', 'New York', 'Seattle']

In [13]:
df

,Date,Atlanta,Boston,Chicago,Charlotte,Dallas-Fort Worth,Denver,Detroit,Houston,Las Vegas,Los Angeles,Miami,Minneapolis,Orlando,Philadelphia,Phoenix,San Francisco,New York,Seattle
0,2010-01-03,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15
1,2010-01-10,21,17,24,6,11,10,10,15,35,17,27,3,16,4,18,14,61,11
2,2010-01-17,13,18,26,5,10,9,9,13,30,20,20,4,15,8,17,17,52,13
3,2010-01-24,17,16,24,8,5,7,9,12,28,18,14,6,18,7,17,11,51,12
4,2010-01-31,17,15,26,5,9,12,8,11,27,21,20,4,19,14,14,12,44,16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
204,2013-12-01,19,18,33,7,35,21,11,16,24,24,21,6,13,9,20,17,51,14
205,2013-12-08,23,23,43,10,30,17,10,17,23,18,26,4,17,15,12,19,57,18
206,2013-12-15,21,28,39,8,16,16,12,18,21,21,28,6,17,10,18,16,58,19
207,2013-12-22,23,20,41,9,21,19,15,20,28,25,28,6,16,11,24,20,63,19
208,2013-12-29,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22

In [14]:
df['Newark'] = df['New York']

In [15]:
df['Date'] = pd.to_datetime(df['Date'], format='%Y-%m-%d')

In [16]:
df

,Date,Atlanta,Boston,Chicago,Charlotte,Dallas-Fort Worth,Denver,Detroit,Houston,Las Vegas,Los Angeles,Miami,Minneapolis,Orlando,Philadelphia,Phoenix,San Francisco,New York,Seattle,Newark
0,2010-01-03,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
1,2010-01-10,21,17,24,6,11,10,10,15,35,17,27,3,16,4,18,14,61,11,61
2,2010-01-17,13,18,26,5,10,9,9,13,30,20,20,4,15,8,17,17,52,13,52
3,2010-01-24,17,16,24,8,5,7,9,12,28,18,14,6,18,7,17,11,51,12,51
4,2010-01-31,17,15,26,5,9,12,8,11,27,21,20,4,19,14,14,12,44,16,44
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
204,2013-12-01,19,18,33,7,35,21,11,16,24,24,21,6,13,9,20,17,51,14,51
205,2013-12-08,23,23,43,10,30,17,10,17,23,18,26,4,17,15,12,19,57,18,57
206,2013-12-15,21,28,39,8,16,16,12,18,21,21,28,6,17,10,18,16,58,19,58
207,2013-12-22,23,20,41,9,21,19,15,20,28,25,28,6,16,11,24,20,63,19,63
208,2013-12-29,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92

In [17]:
df.set_index('Date', inplace=True)

In [18]:
df

,Atlanta,Boston,Chicago,Charlotte,Dallas-Fort Worth,Denver,Detroit,Houston,Las Vegas,Los Angeles,Miami,Minneapolis,Orlando,Philadelphia,Phoenix,San Francisco,New York,Seattle,Newark
Date,,,,,,,,,,,,,,,,,,,
2010-01-03,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
2010-01-10,21,17,24,6,11,10,10,15,35,17,27,3,16,4,18,14,61,11,61
2010-01-17,13,18,26,5,10,9,9,13,30,20,20,4,15,8,17,17,52,13,52
2010-01-24,17,16,24,8,5,7,9,12,28,18,14,6,18,7,17,11,51,12,51
2010-01-31,17,15,26,5,9,12,8,11,27,21,20,4,19,14,14,12,44,16,44
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2013-12-01,19,18,33,7,35,21,11,16,24,24,21,6,13,9,20,17,51,14,51
2013-12-08,23,23,43,10,30,17,10,17,23,18,26,4,17,15,12,19,57,18,57
2013-12-15,21,28,39,8,16,16,12,18,21,21,28,6,17,10,18,16,58,19,58
2013-12-22,23,20,41,9,21,19,15,20,28,25,28,6,16,11,24,20,63,19,63
2013-12-29,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92

In [19]:
offset = pd.offsets.DateOffset(-5)
df.loc[df.index[-1] - offset] = df.iloc[-1]
df = df.resample('D', loffset=offset).ffill()

In [20]:
df.head(10)

,Atlanta,Boston,Chicago,Charlotte,Dallas-Fort Worth,Denver,Detroit,Houston,Las Vegas,Los Angeles,Miami,Minneapolis,Orlando,Philadelphia,Phoenix,San Francisco,New York,Seattle,Newark
Date,,,,,,,,,,,,,,,,,,,
2009-12-29,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
2009-12-30,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
2009-12-31,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
2010-01-01,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
2010-01-02,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
2010-01-03,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
2010-01-04,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
2010-01-05,21,17,24,6,11,10,10,15,35,17,27,3,16,4,18,14,61,11,61
2010-01-06,21,17,24,6,11,10,10,15,35,17,27,3,16,4,18,14,61,11,61
2010-01-07,21,17,24,6,11,10,10,15,35,17,27,3,16,4,18,14,61,11,61

In [21]:
df.reset_index(inplace=True)

In [22]:
df

,Date,Atlanta,Boston,Chicago,Charlotte,Dallas-Fort Worth,Denver,Detroit,Houston,Las Vegas,Los Angeles,Miami,Minneapolis,Orlando,Philadelphia,Phoenix,San Francisco,New York,Seattle,Newark
0,2009-12-29,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
1,2009-12-30,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
2,2009-12-31,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
3,2010-01-01,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
4,2010-01-02,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1457,2013-12-25,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92
1458,2013-12-26,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92
1459,2013-12-27,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92
1460,2013-12-28,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92
1461,2013-12-29,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92

In [23]:
#df['Day'] = df['Date'].dt.day
#df['Week'] = df['Date'].dt.week
#df['Weekday'] = df['Date'].dt.weekday
#df['Year'] = df['Date'].dt.year

In [24]:
df

,Date,Atlanta,Boston,Chicago,Charlotte,Dallas-Fort Worth,Denver,Detroit,Houston,Las Vegas,Los Angeles,Miami,Minneapolis,Orlando,Philadelphia,Phoenix,San Francisco,New York,Seattle,Newark
0,2009-12-29,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
1,2009-12-30,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
2,2009-12-31,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
3,2010-01-01,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
4,2010-01-02,25,24,36,6,10,13,23,19,39,21,26,8,24,11,14,19,60,15,60
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1457,2013-12-25,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92
1458,2013-12-26,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92
1459,2013-12-27,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92
1460,2013-12-28,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92
1461,2013-12-29,31,37,65,12,21,27,15,22,32,25,35,7,23,17,25,23,92,22,92

In [32]:
#from itertools import product
#A = df['Date'].values.tolist()
#cols = ['Atlanta', 'Boston', 'Chicago', 'Charlotte', 'Dallas-Fort Worth', 'Denver', 'Detroit', 'Houston', 'Las Vegas', 'Los Angeles', 'Miami', 'Minneapolis', 'Orlando', 'Philadelphia', 'Phoenix', 'San Francisco', 'New York', 'Seattle']
#B = df[cols].values.tolist()
#df2 = pd.DataFrame([x + y for x, y in (product(A, B))])

<itertools.product object at 0x7f9ed3c25f00>